app/Controllers/Anggota.php

SELECT *
FROM `anggota`
---
    public function formanggota()
    {
        $anggotamodel = new \App\Models\AnggotaModel();
        $anggota = $anggotamodel->findAll();