app/Controllers/Buku.php

SELECT *
FROM `buku`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function formbuku()
    {
        session();
        $pager = \Config\Services::pager();
        $bukumodel = new \App\Models\BukuModel();
        $keyword = $this->request->getVar('cari');
        if ($keyword) {
            $buku = $bukumodel->cari($keyword);
        } else {
            $buku = $bukumodel;
        }
        $data = [
            'title' => 'Buku',
            'Buku' => $buku->paginate(2, 'databuku'),