app/Controllers/Login.php

    public function index()
    {
        $ModelMember = new \App\Models\ModelMember();
        $login = $this->request->getPost('login');
        if ($login) {
            $member_username = $this->request->getPost('member_username');
            $member_password = $this->request->getPost('member_password');

            if ($member_username == '' or $member_password == '') {
                $err = "Silahkan Masukan Username dan Password";
            }
            if (empty($err)) {
                $dataMember = $ModelMember->where("member_username", $member_username)->first();
---
SELECT *
FROM `member`
WHERE `member_username` = 'tessa'
 LIMIT 1