app/Controllers/Peminjaman.php

SELECT *
FROM `peminjaman`
---
    public function index()
    {
        $peminjamanmodel = new \App\Models\PeminjamanModel();
        $peminjaman = $peminjamanmodel->findAll();

SELECT *
FROM `peminjaman`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
---
    public function formpeminjaman()
    {
        session();
        $pager = \Config\Services::pager();
        $peminjamanmodel = new \App\Models\PeminjamanModel();
        $keyword = $this->request->getVar('cari');
        if ($keyword) {
            $peminjaman = $peminjamanmodel->cari($keyword);
        } else {
            $peminjaman = $peminjamanmodel;
        }
        $data = [
            'title' => 'Peminjaman',
            'Peminjaman' => $peminjaman->paginate(2, 'datapinjam'),