app/Controllers/Pengembalian.php

    public function index()
    {
        $pengembalianmodel = new \App\Models\PengembalianModel();
        $pengembalian = $pengembalianmodel->findAll();
---
SELECT *
FROM `pengembalian`

    public function formpengembalian()
    {
        $pengembalianmodel = new \App\Models\PengembalianModel();
        $pengembalian = $pengembalianmodel->findAll();
---
SELECT *
FROM `pengembalian`