app/Models/PeminjamanModel.php

SELECT *
FROM `peminjaman`
WHERE `kode_pinjam` = 'P001'
 LIMIT 1
---
    public function find($kode_pinjam = null)
    {
        return $this->where(['kode_pinjam' => $kode_pinjam])->first();